// class Menu {
//   final String title;
//   final String imageUrl;
//   final String description;

//   Menu({
//     required this.title,
//     required this.imageUrl,
//     required this.description,
//   });
// }

// final List<Menu> menus = [
//   Menu(
//     title: 'รู้ทันความดันโลหิต',
//     imageUrl:
//         'https://siph-space.sgp1.digitaloceanspaces.com/uploads/editor/1602837771_Blood_pressure_monitor.JPG',
//     description:
//         'โรคความดันโลหิตสูงจัดเป็นหนึ่งในโรคเรื้อรังที่มีความร้ายแรง เพราะส่วนมากไม่มีทางรักษาแต่สามารถควบคุมได้ด้วยการปรับเปลี่ยนวิถีชีวิตหรือรับประทานยาตามที่แพทย์สั่ง “ค่าความดันโลหิตเป้าหมายในคนปกติไม่ควรเกินกว่า 120/80 มิลลิเมตรปรอท ซึ่งเป็นค่าที่ประเมินกันแล้วว่าไม่ก่อให้เกิดความเสียหายแก่หลอดเลือดมาก เมื่อไรที่ผู้ป่วยมาพบแพทย์ และมีการวัดความดันซึ่งอ่านค่าได้ 120/80 หรือมากกว่าก็ต้องถือว่าความดันเริ่มจะสูงแล้ว (Pre-hypertension) แต่ยังไม่เป็นความดันสูงเต็มขั้น แพทย์จะแนะนำเรื่องการปรับเปลี่ยนวิถีชีวิตเพื่อควบคุมความดันโลหิตไม่ให้สูงไปกว่านี้” ในกรณีที่ผู้ป่วยไม่อาจปรับเปลี่ยนวิถีชีวิตได้ หรือปรับแล้ว แต่ความดันไม่ลดลงตามเป้าหมาย แพทย์จึงจะพิจารณาให้ยาที่เหมาะสมต่อไปโดยมีเป้าหมายระยะสั้นอยู่ที่การควบคุมความดันโลหิตให้อยู่ในเกณฑ์ไม่เกิน 140/90 มิลลิเมตรปรอทและเป้าหมายระยะยาวอยู่ที่การป้องกันภาวะแทรกซ้อนเพื่อให้คุณภาพชีวิตของผู้ป่วยดีขึ้น',
//   ),
//   // Menu(
//   //   title: 'ความดันโลหิตสูงอันตราย!!!',
//   //   imageUrl:
//   //       'https://lh3.googleusercontent.com/proxy/LFJ8IpQ6uV1Q444jilidIbGiWwziDAh1uXE9WLWC4vR44EqnVLxeqQ28ShqL0SI5hfmFfjjLcxgXNmv4iTRNxjpDKEcVgHBw-KnwLC5oWq0uwnTqqfXblSWiHFTiJuf4ZDq5YfGlVSV_WyQsRXKq6gePUBmyhGCIPgG5fA',
//   //   description:
//   //       'ความดันโลหิตสูง เป็นภาวะที่เมื่อหัวใจบีบ และคลายตัวแต่ความดันยังคงค้างอยู่ในหลอดเลือด ไม่ลดลงอย่างที่ควรจะเป็นซึ่งพญ. ประภาพร พิมพ์พิไล อายุรแพทย์ อธิบายว่า “การมีความดันโลหิตสูงอย่างต่อเนื่องเป็นเวลานาน สร้างความเสียหายแก่หลอดเลือดหลายประการ อาทิ หลอดเลือดแข็ง หลอดเลือดโป่งพอง อีกทั้งยังอาจนำไปสู่โรคแทรกซ้อนที่เป็นอันตรายอีกหลายโรค”  ความดันโลหิตสูงมีความสัมพันธ์กับการเกิดโรคหัวใจ โรคหลอดเลือดสมอง โรคไต และโรคเส้นเลือดแดงใหญ่โป่งพอง การควบคุมรักษาความดันโลหิตสูงอย่างเหมาะสมจึงมีความสำคัญในการป้องกันโรคแทรกซ้อนที่จะเกิดกับอวัยวะต่าง ๆ ดังกล่าวคือ หัวใจวาย หลอดเลือดหัวใจตีบ โรคไตวายเรื้อรัง อัมพาต และอัมพฤกษ์ ',
//   // ),
//   Menu(
//     title: 'เบาหวานคืออะไร',
//     imageUrl:
//         'https://website-storage.princhealth.com/psuv/articles/20231116025520-%E0%B8%97%E0%B8%94%E0%B8%AA%E0%B8%AD%E0%B8%9A%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B9%80%E0%B8%AA%E0%B8%B5%E0%B9%88%E0%B8%A2%E0%B8%87%E0%B9%80%E0%B8%9A%E0%B8%B2%E0%B8%AB%E0%B8%A7%E0%B8%B2%E0%B8%99-%E0%B9%82%E0%B8%A3%E0%B8%87%E0%B8%9E%E0%B8%A2%E0%B8%B2%E0%B8%9A%E0%B8%B2%E0%B8%A5%E0%B8%9E%E0%B8%A3%E0%B8%B4%E0%B9%89%E0%B8%99%E0%B8%8B%E0%B9%8C%E0%B8%AA%E0%B8%B8%E0%B8%A7%E0%B8%A3%E0%B8%A3%E0%B8%93%E0%B8%A0%E0%B8%B9%E0%B8%A1%E0%B8%B4.jpg',
//     description:
//         'โรคเบาหวาน (Diabetes) คือโรคที่เกิดจากความผิดปกติของการทำงานของฮอร์โมนที่ชื่อว่า อินสุลิน (Insulin) ซึ่งโดยปกติแล้วร่างกายของคนเราจำเป็นต้องมีอินสุลิน เพื่อนำน้ำตาลในกระแสเลือดไปเลี้ยงอวัยวะต่าง ๆ ของร่างกาย โดยเฉพาะสมองและกล้ามเนื้อ ในภาวะที่อินสุลินมีความผิดปกติ ไม่ว่าจะเป็นการลดลงของปริมาณอินสุลินในร่างกาย หรือการที่อวัยวะต่าง ๆ ของร่างกายตอบสนองต่ออินสุลินลดลง (หรือที่เรียกว่า ภาวะดื้ออินสุลิน) จะทำให้ร่างกายไม่สามารถนำน้ำตาลที่อยู่ในกระแสเลือดไปใช้ได้อย่างเต็มประสิทธิภาพ ทำให้มีปริมาณน้ำตาลคงเหลือในกระแสเลือดมากกว่าปกติ  สาเหตุของโรคเบาหวานเกิดจากการที่ระดับน้ำตาลในกระแสเลือดสูงมากขึ้นถึงระดับหนึ่ง จนทำให้ไตดูดกลับน้ำตาลได้ไม่หมด ซึ่งปกติไตจะมีหน้าที่ดูดกลับน้ำตาลจากสารที่ถูกกรองจากหน่วยไตไปใช้ ส่งผลให้มีน้ำตาลรั่วออกมากับปัสสาวะ จึงเป็นที่มาของคำว่า “โรคเบาหวาน” หากเราปล่อยให้เกิดภาวะเช่นนี้ไปนาน ๆ โดยไม่ได้รับการรักษาอย่างถูกวิธี จะทำให้เกิดภาวะแทรกซ้อนที่ร้ายแรงตามมาในที่สุด',
//   ),
//   Menu(
//     title: 'คุณเป็นเบาหวานหรือไม่',
//     imageUrl:
//         'https://mp-cms.medparkhospital.com/assets/88d3ba6b-1d05-46e8-9013-baa800fe77cf/diabetes-mellitus.jpeg',
//     description:
//         'การตรวจสอบว่าเป็นโรคเบาหวานหรือไม่ ทำได้โดยการตรวจวัดระดับน้ำตาลในเลือดซึ่งเป็นวิธีที่ง่าย และ ได้ผลดี การวินิจฉัยโรคเบาหวานสามารถทำได้โดยอาศัยเกณฑ์การวินิจฉัยดังนี้มีระดับน้ำตาลในเลือดขณะงดอาหารและเครื่องดื่มอย่างน้อย 8 ชั่วโมง มากกว่าหรือเท่ากับ 126 มิลลิกรัม/เดซิลิตรมีอาการของโรคเบาหวาน ร่วมกับระดับน้ำตาลในเลือดเวลาใดก็ตามมีค่ามากกว่าหรือเท่ากับ 200 มิลลิกรัม/เดซิลิตรมีระดับน้ำตาลในเลือด มากกว่าหรือเท่ากับ 200 มิลลิกรัม/เดซิลิตร ณ 2 ชั่วโมง ภายหลังทดสอบความทนต่อน้ำตาลกลูโคส 75 กรัมที่รับประทานเข้าไปมีระดับน้ำตาลเฉลี่ยสะสม (HbA1c) มากกว่าหรือเท่ากับร้อยละ 6.5 ขึ้นไปหากผลการตรวจหลังงดอาหารและเครื่องดื่มแล้ว ปรากฏว่ามีน้ำตาลอยู่กระแสเลือด 100-125 มิลลิกรัม/เดซิลิตร เดี๋ยวนี้ก็ถือว่าเริ่มผิดปกติ และมีแนวโน้มว่าจะเป็นเบาหวานเต็มขั้น',
//   ),
//   Menu(
//     title: 'ดัชนีมวลกาย สำคัญอย่างไร',
//     imageUrl: 'https://img.kapook.com/u/2024/wanwanat/bmi.jpg',
//     description:
//         'การคำนวณค่าดัชนีมวลกาย นอกจากเราได้ทราบถึงรูปร่างและสัดส่วนแล้ว ยังทำให้เราทราบถึงความเสี่ยงการเกิดโรคต่าง ๆ ได้จริงหรือ แล้วค่าดัชนีมวลกายเป็นตัวบ่งชี้อะไรได้บ้าง จะมาไขคำตอบเกี่ยวกับเรื่องนี้ค่าดัชนีมวลกาย Body Mass Index หรือเรียกย่อ ๆ ว่า BMI คือ ตัวชี้วัดมาตรฐานเพื่อประเมินสภาวะของร่างกายว่า มีความสมดุลของน้ำหนักตัวต่อส่วนสูงอยู่ในเกณฑ์ที่เหมาะสมหรือไม่ค่า BMI สามารถใช้เป็นเครื่องมือคัดกรองเพื่อระบุผู้ที่มีน้ำหนักเกิน หรือภาวะอ้วนและผู้ที่มีน้ำหนักต่ำกว่าเกณฑ์มาตรฐานในผู้ใหญ่ที่อายุ 20 ปีขึ้นไปค่า BMI คำนวณจาก ค่าของน้ำหนักตัวหน่วยเป็นกิโลกรัม หารด้วยส่วนสูงหน่วยเป็นเมตร ยกกำลัง 2 และแสดงในหน่วย กก./ม2',
//   ),
//   Menu(
//     title: 'การปฏิบัติตัวเองเพื่อให้ห่างไกลโรค',
//     imageUrl:
//         'https://www.si.mahidol.ac.th/sidoctor/sirirajonline2021/Article_images/1361_0.jpg',
//     description:
//         '  1. เลือกการบริโภคอาหารและเครื่องดื่ม โดยเลือกอาหารที่มีคุณค่าทางโภชนาการ โดยเฉพาะธัญพืช ผัก และผลไม้ ไม่ควรรับประทานอาหารมื้อหลักเกินวันละ 3 มื้อ และเลือกรับประทานอาหารที่มีแคลอรี่ต่ำ หลีกเลี่ยงหรือลดการรับประทานอาหารมื้อหนักที่ต้องรับประทานมาก ๆ เช่น อาหารบุฟเฟ่ต์ อาหารที่มีไขมันหรือน้ำตาลสูง ของมัน ของทอด เนื้อสัตว์ติดมัน และเลือกดื่มน้ำเปล่าหรือ  นมไขมันต่ำแทนน้ำหวาน น้ำอัดลม และเครื่องดื่มแอลกอฮอล์  2. การออกกำลังกาย ควรออกกำลังกายด้วยกิจกรรมที่เหมาะสมกับสภาพร่างกายอย่างน้อย 150 – 300 นาที / สัปดาห์ ด้วยการเดิน วิ่ง เต้นแอโรบิก ปั่นจักรยาน ว่ายน้ำ การออกกำลังกายเฉพาะส่วน อย่างการใช้เครื่องออกกำลังกาย การยกน้ำหนักหรือออกกำลังกายแบบผสมผสานกันหลายประเภท การออกกำลังกายไม่ได้จำกัดแต่เพียงในโรงยิม เพราะสามารถเปลี่ยนกิจกรรมที่ทำในชีวิตประจำวันให้เป็นการออกกำลังกายไปในขณะเดียวกันได้ด้วย เช่น การทำงานบ้านด้วยตัวเอง ลดการใช้สิ่งอำนวยความสะดวกลง เดินให้มากขึ้น',
//   ),
// ];

import 'package:health/api_connection/api_connetion.dart';
import 'package:http/http.dart' as http;
import 'dart:convert';

Future<List<Menu>> fetchHealthcare() async {
  final response = await http.get(Uri.parse(API.get_health));

  if (response.statusCode == 200) {
    List<dynamic> jsonData = json.decode(response.body);
    return jsonData.map((data) => Menu.fromJson(data)).toList();
  } else {
    throw Exception('Failed to load healthcare');
  }
}

class Menu {
  final String title;
  final String imageUrl;
  final String description;

  Menu({required this.title, required this.imageUrl, required this.description});

  factory Menu.fromJson(Map<String, dynamic> json) {
    return Menu(
      title: json['title'],
      imageUrl: json['imageUrl'],
      description: json['description'],
    );
  }
}